<template>
  <div>
    <div class="w-[85%] mx-auto bg-white p-10">
      <img src="@/assets/images/home/aboutUs/about-us.jpg" alt="about-us" />
      <div class="my-10">
        <span class="caption text-lg font-bold pl-10 pr-3 pt-2 pb-3"
          >درباره میهن بلاکچین</span
        >
      </div>
      <p class="text-justify leading-8">
        میهن بلاکچین فعالیت خود را از سال ۱۳۹۶ شروع کرده و با فعالیت بر روی
        پروژه‌های مختلف داخلی و بین‌المللی، موفق به کسب دستاوردهای متعددی در
        حوزه بلاکچین و ارزهای دیجیتال شده است. ما در میهن بلاکچین معتقدیم گسترش
        نفع جمعی منجر به پیشرفت فردی و در نهایت ارتقای اکوسیستم و جامعه خواهد
        شد. به همین منظور میهن بلاکچین در این سال‌ها تلاش کرده با ارتقای سطح
        دانش کاربران خود و ارائه سرویس‌های متنوع و کاربردی، میزان آگاهی و دانش
        در این حوزه را همواره بالا ببرد. با توجه به جدید بودن تکنولوژی بلاک چین
        و حوزه رمزارزها، از قدیم تا به امروز تمرکز اصلی ما بر روی آموزش مفاهیم
        این حوزه به مردم کشورمان بوده است؛ هدف از این کار، توانمندسازی مردم
        کشورمان برای استفاده از پتانسیل‌های متعدد این حوزه است. میهن بلاکچین
        متشکل از چندین تیم حرفه‌ای، متخصص و توانمند است که در زمینه بلاکچین، بیت
        کوین و سایر ارزهای دیجیتال فعالیت می‌کند.
      </p>
    </div>
  </div>
</template>

<script setup></script>

<style lang="scss" scoped>
.caption {
  background-color: #38bdf8;
  color: white;
  clip-path: polygon(0 0, 100% 0, 100% 100%, 22% 100%);
}
</style>
