<template>
  <div>
    <div class="w-[80%] mx-auto bg-white p-10">
      <img src="@/assets/images/employment.jpg" alt="employment" />
      <div class="my-10">
        <span class="caption text-lg font-bold pl-10 pr-3 pt-2 pb-3"
          >فرصت های شغلی</span
        >
      </div>
      <p class="text-justify leading-8">
        در میهن بلاکچین باور داریم همه چیز بی‌نهایت است و هیچ مسیری انتها و
        بن‌بست ندارد. در اینجا بستر پیشرفت همواره فراهم است و پویایی فضای کار و
        ارتقای حرفه‌ای کارمندان از اولویت بالایی برخوردار است. در میهن بلاکچین
        «یک دست صدا ندارد» دیگر یک شعار نیست و می‌توان نقش این مفهوم را در تمام
        ابعاد سازمان مشاهده کرد. تمام سعی ما بر این است که با ایجاد اعتماد
        متقابل، شفافیت کاری و صمیمیت بین اعضا، فضایی پویا و پیشرو برای تمام
        اعضای شرکت فراهم کنیم. در میهن بلاکچین اولویت ما رضایت همکاران از فضای
        کاری است.در میهن بلاکچین رضایت همکاران است که موجب پیشرفت و رسیدن به
        اهداف شرکت می‌شود. ما برای فراهم آوردن رضایت و آرامش همکاران، زمینه‌های
        زیر را فراهم کرده‌ایم و همواره از پیشنهادات برای ارتقای فضای کاری
        استقبال می‌کنیم:
      </p>
      <ul class="mt-10">
        <li
          v-for="(item, index) in options"
          :key="index"
          class="flex items-center leading-8"
        >
          <i class="icon-circle custom-font-10"></i
          ><span class="mr-2">{{ item.title }}</span>
        </li>
      </ul>
      <p class="mt-10 bg-[#d6f6ff] px-3 py-5">
        جهت دریافت اطلاعات بیشتر می توانید به
        <a href="https://jobinja.ir/companies/mihanblockchain-1/about" class="text-[#38bdf8]"
          >صفحه میهن بلاکچین در جابینجا</a
        >
        مراجعه کنید.
      </p>
    </div>
  </div>
</template>

<script setup>
const options = [
  { title: "پویایی فضای کار، امکان یادگیری و پیشرفت در حوزه کاری" },
  { title: "تجربه یک فضای همکاری آرام، دوستانه و صمیمی" },
  { title: "آسایش و امنیت شغلی" },
  { title: "کار تیمی" },
  { title: "استقبال از ایده‌ها" },
  { title: "صداقت، شفافیت و انتقادپذیری" },
  { title: "ارتباط موثر تیم‌های مختلف به منظور ایجاد راهکارهای بهینه" },
  { title: "ارتباط موثر تیم‌های مختلف به منظور ایجاد راهکارهای بهینه" },
  { title: "برگزاری برنامه‌های تفریحی" },
  {
    title:
      "دیده شدن تلاش همکاران و امکان پیشرفت بر اساس قابلیت‌ها و توانمندی‌های فردی",
  },
];
</script>

<style lang="scss" scoped>
.caption {
  background-color: #38bdf8;
  color: white;
  clip-path: polygon(0 0, 100% 0, 100% 100%, 12% 100%);
}
</style>
