<template>
  <div>
    <span class="caption text-lg font-bold pl-10 pr-3 pt-2 pb-3"
      >آخرین مطالب</span
    >
    <div class="mt-10">
      <CommonSingleArticle  v-for="(singleArticle, index) in articles"
        :key="index"
        :singleArticle="singleArticle">
        <nuxt-link
        to="/"
        class="article-type absolute z-10 bottom-0 left-0 text-white px-5 py-1 rounded-md transition-colors custom-font-12"
        >{{ singleArticle.type }}</nuxt-link
      >
      </CommonSingleArticle>
     
    </div>
  </div>
</template>

<script setup>
const articles = [
  {
    title:
      "تحلیل تکنیکال قیمت بیت کوین، سولانا، آوالانچ، RNDR و سویی: ۹ بهمن ۱۴۰۲",
    description:
      "قیمت بیت کوین در روزهای اخیر آرام آرام افزایش یافته که نشان‌دهنده تداوم تقاضا از جانب خریداران (گاوها) است. به گفته جیمز سیفرت (James Seyffart)، تحلیلگر بلومبرگ، ارزش بیت کوین‌های تحت مدیریت صندوق آی‌شرز بیت کوین تراست (IBIT) ",
    authore: "علی ابراهیمی",
    img: "1.jpg",
    date: "9 بهمن 1402 - 13:10",
    type: "تحلیل تکنیکال",
  },
  {
    title:
      "ماجرای مصوبه جدید مجلس برای اخذ مالیات از حساب‌های شخصی و غیر تجاری چیست؟",
    description:
      "اخیرا اخباری در شبکه‌های اجتماعی پخش شده است که ادعا می‌کنند حساب‌های شخصی از سال بعد باید مالیات بدهند. با این حال، بررسی‌های موجود نشان می‌دهد این مسئله صحت ندارد و مصوبه مجلس برای حساب‌های شخصی مردم عادی وضع نشده…",
    authore: "کوثر ایزک شیریان",
    img: "2.jpg",
    date: "9 بهمن 1402 - 11:07",
    type: "ایردراپ",
  },
  {
    title: "فردا سیاست جدید تبلیغات گوگل برای ارزهای دیجیتال اجرا خواهد شد",
    description:
      "شرکت گوگل قرار است فردا، ۲۹ ژانویه (۹ بهمن) تازه‌ترین سیاست‌های خود برای تبلیغات ارزهای دیجیتال و برخی از محصولات مرتبط با حوزه کریپتو را اجرایی کند. بدین ترتیب، احتمالا شاهد تبلیغات صندوق‌های قابل معامله بورسی اسپات (ETF) بیت کوین…",
    authore: "علی ابراهیمی",
    img: "3.jpg",
    date: "8 بهمن 1402 - 18:00",
    type: "تحلیل تکنیکال",
  },
  {
    title: "پیش‌نیاز ETF اسپات ریپل چیست؟ خبرنگار فاکس بیزنس پاسخ می‌دهد",
    description:
      "با تایید صندوق‌های قابل‌معامله در بورس (ETF) اسپات بیت کوین در آمریکا در ۱۰ ژانویه (۲۰ دی)، معامله‌گران نسبت به تایید ETFهای اسپات بقیه رمزارزها از جمله ریپل (XRP) امیدوار شدند؛ اما به نظر می‌رسد بسیاری از آن‌ها پیش‌نیاز لازم…",
    authore: "علی ابراهیمی",
    img: "4.jpg",
    date: "8 بهمن 1402 - 18:00",
    type: "اخبار عمومی",
  },
  {
    title: "برای دریافت ایردراپ WEN فقط ۲ روز مهلت باقی مانده است",
    description:
      "طبق داده‌های موجود، تنها نیمی از کیف پول‌های واجد شرایط ایردراپ WEN توکن‌های خود را دریافت کرده‌اند. از طرفی، فقط ۲ روز برای دریافت این توکن‌ها باقی مانده است و تمام توکن‌های ایردراپ‌نشده در نهایت سوزانده می‌شوند. به نقل از…",
    authore: "علی ابراهیمی",
    img: "5.jpg",
    date: "8 بهمن 1402 - 18:00",
    type: "اخبار بیت کوین",
  },
  {
    title:
      "بازار در انتظار کلوز کندل هفتگی بیت کوین؛ احتمال رشد قیمت وجود دارد؟",
    description:
      "بیت کوین (BTC) احتمالا خود را برای آزمایش مقاومت‌های جدید آماده کرده و بعضی از تحلیلگران معتقدند قیمت BTC می‌تواند به ۴۸٬۰۰۰ دلار برسد. به نقل از ‌کوین‌‌ تلگراف، قیمت بیت کوین روز گذشته به بالای ۴۲٬۰۰۰ دلار رسید و…",
    authore: "کوثر ایزک شیریان",
    img: "6.jpg",
    date: "8 بهمن 1402 - 18:00",
    type: "اخبار آلتکوین",
  },
  {
    title: "نفت به بالاترین قیمت ۲ ماه اخیر رسید",
    description:
      "به دنبال رشد اقتصادی مثبت آمریکا و اخبار مربوط به بسته‌های محرک اقتصادی چین و همچنین بحران فعلی در منطقه خاورمیانه، قیمت نفت دومین هفته افزایشی متوالی خود را ثبت کرد و به بالاترین سطح در دو ماه اخیر رسید.…",
    authore: "کوثر ایزک شیریان",
    img: "7.jpg",
    date: "8 بهمن 1402 - 18:00",
    type: "ایردراپ",
  },
  {
    title: "بررسی دلایل افزایش قیمت بیت کوین؛ همچنان احتمال ریزش وجود دارد",
    description:
      "بیت کوین بالاخره روز گذشته اندکی از فاز رریزشی خارج شد و پس از انقضای ۴.۵ میلیارد دلار از قراردادهای آپشن به بالای ۴۰٬۰۰۰ دلار بازگشت. در ادامه، قیمت بیت کوین به ۴۲٬۰۰۰ دلار رسید. روند فعلی بیت کوین را…",
    authore: "کوثر ایزک شیریان",
    img: "8.jpg",
    date: "8 بهمن 1402 - 18:00",
    type: "اخبار بیت کوین",
  },
  {
    title: "تحلیل تکنیکال قیمت بیت کوین و ۹ آلت کوین منتخب بازار؛ ۷ بهمن ۱۴۰۲",
    description:
      "قیمت بیت کوین (BTC) در ساعات گذشته بیش از ۴٪ رشد کرده و برای لحظاتی از ۴۲٬۰۰۰ نیز دلار عبور کرده است. حال سوال این جا است که آیا آلت کوین‌ها هم به دنبال آن رشد می‌کنند؟ به نقل از…",
    authore: "کوثر ایزک شیریان",
    img: "9.jpg",
    date: "8 بهمن 1402 - 18:00",
    type: "اخبار عمومی",
  },
  {
    title:
      "ایردراپ ۷۰۰ میلیون دلار ارز دیجیتال در روزهای آتی؛ فصل ایردراپ‌ها شروع شده است؟",
    description:
      "همزمان با صعودی شدن بازار ارزهای دیجیتال در ماه‌های گذشته، تعداد زیادی از پروژه‌ها از ایردراپ توکن خود بین کاربران واجد شرایط خبر داده‌اند. در روزهای آتی نیز نزدیک به ۷۰۰ میلیون دلار توکن مختلف بین کاربران ایردراپ خواهد شد.…",
    authore: "کوثر ایزک شیریان",
    img: "10.jpg",
    date: "8 بهمن 1402 - 18:00",
    type: "اخبار بیت کوین",
  },
];
</script>

<style lang="scss" scoped>
.caption {
  background-color: #38bdf8;
  color: white;
  clip-path: polygon(0 0, 100% 0, 100% 100%, 25% 100%);
}
.article-type {
  background: linear-gradient(
    90deg,
    rgba(22, 31, 43, 1) 70%,
    rgba(0, 168, 255, 1) 100%
  );
  &:hover {
    background: #38bdf8;
  }
}

</style>
